ir_version: 6
producer_name: "GE"
graph {
  node {
    input: ""
    output: "data:0"
    name: "data"
    op_type: "ge:Data"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 3145728
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 3145760
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_attr_infer_format:0"
      i: 3
      type: INT
    }
    attribute {
      name: "id"
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "data_type"
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "data:0"
    output: "trans_Cast_0:0"
    name: "trans_Cast_0"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 3145760
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 1572896
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "id"
      i: 1
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
  }
  node {
    input: "trans_Cast_0:0"
    output: "trans_TransData_1:0"
    name: "trans_TransData_1"
    op_type: "ge:TransData"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 1572896
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 1
      ints: 512
      ints: 512
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NC1HWC0"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 8388640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 5
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "id"
      i: 2
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "output_format"
      i: 3
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "input_format"
      type: INT
    }
  }
  node {
    output: "dynamic_const_49:0"
    name: "dynamic_const_49"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "id"
      i: 3
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_49:0"
    output: "trans_Cast_80:0"
    name: "trans_Cast_80"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "id"
      i: 4
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
  }
  node {
    output: "dynamic_const_48:0"
    name: "dynamic_const_48"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_attr_infer_format:0"
      i: 4
      type: INT
    }
    attribute {
      name: "id"
      i: 5
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_48:0"
    output: "trans_TransData_78:0"
    name: "trans_TransData_78"
    op_type: "ge:TransData"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 1184
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 18
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 18464
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 6
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "output_format"
      i: 4
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "input_format"
      type: INT
    }
  }
  node {
    input: "trans_TransData_78:0"
    output: "trans_Cast_79:0"
    name: "trans_Cast_79"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 18
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 18464
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 18
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 9248
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 7
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
  }
  node {
    output: "dynamic_const_47:0"
    name: "dynamic_const_47"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 8
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_47:0"
    output: "trans_Cast_73:0"
    name: "trans_Cast_73"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 9
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
  }
  node {
    output: "dynamic_const_46:0"
    name: "dynamic_const_46"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_attr_infer_format:0"
      i: 4
      type: INT
    }
    attribute {
      name: "id"
      i: 10
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_46:0"
    output: "trans_TransData_71:0"
    name: "trans_TransData_71"
    op_type: "ge:TransData"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 2336
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 9248
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 11
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "output_format"
      i: 4
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "input_format"
      type: INT
    }
  }
  node {
    input: "trans_TransData_71:0"
    output: "trans_Cast_72:0"
    name: "trans_Cast_72"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 9248
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 12
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
  }
  node {
    output: "dynamic_const_45:0"
    name: "dynamic_const_45"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 13
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_45:0"
    output: "trans_Cast_70:0"
    name: "trans_Cast_70"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 64
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 14
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
  }
  node {
    output: "dynamic_const_44:0"
    name: "dynamic_const_44"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_attr_infer_format:0"
      i: 4
      type: INT
    }
    attribute {
      name: "id"
      i: 15
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    input: "dynamic_const_44:0"
    output: "trans_TransData_68:0"
    name: "trans_TransData_68"
    op_type: "ge:TransData"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 2336
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 9248
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 16
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "input_format"
      type: INT
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "output_format"
      i: 4
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
  }
  node {
    input: "trans_TransData_68:0"
    output: "trans_Cast_69:0"
    name: "trans_Cast_69"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
