ir_version: 6
producer_name: "GE"
graph {
  node {
    input: ""
    output: "data:0"
    name: "data"
    op_type: "ge:Data"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 3145728
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 3145760
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_attr_infer_format:0"
      i: 3
      type: INT
    }
    attribute {
      name: "id"
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "trans_Cast_0"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "data_type"
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "data:0"
    output: "trans_Cast_0:0"
    name: "trans_Cast_0"
    op_type: "ge:Cast"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 3145760
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 1572896
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "id"
      i: 1
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "src_name"
      strings: "data"
      type: STRINGS
    }
    attribute {
      name: "src_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "dst_name"
      strings: "trans_TransData_1"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "tbe_op_atomic_workspace_flag"
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "ub_atomic_params"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "tvm_blockdim"
      i: 2
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "dst_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_is_n_batch_split"
      i: 1
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "truncate"
      type: INT
    }
    attribute {
      name: "DstT"
      i: 1
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "tbe_op_atomic_output_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "SrcT"
      type: INT
    }
  }
  node {
    input: "trans_Cast_0:0"
    output: "trans_TransData_1:0"
    name: "trans_TransData_1"
    op_type: "ge:TransData"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 1572896
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 1
      ints: 512
      ints: 512
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NC1HWC0"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 8388640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 5
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "id"
      i: 2
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "src_name"
      strings: "trans_Cast_0"
      type: STRINGS
    }
    attribute {
      name: "src_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "dst_name"
      strings: "conv1_1relu1_1"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "_node_need_compile"
      i: 1
      type: INT
    }
    attribute {
      name: "tbe_op_atomic_workspace_flag"
      type: INT
    }
    attribute {
      name: "isCheckSupported"
      type: INT
    }
    attribute {
      name: "output_format"
      i: 3
      type: INT
    }
    attribute {
      name: "ub_atomic_params"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "tvm_blockdim"
      i: 2
      type: INT
    }
    attribute {
      name: "imply_type"
      i: 1
      type: INT
    }
    attribute {
      name: "_is_n_batch_split"
      type: INT
    }
    attribute {
      name: "_fe_imply_type"
      i: 6
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
    attribute {
      name: "tbe_op_atomic_output_index"
      ints: 0
      type: INTS
    }
    attribute {
      name: "input_format"
      type: INT
    }
  }
  node {
    output: "dynamic_const_124:0"
    name: "dynamic_const_124"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 3
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_1relu1_1"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_123:0"
    name: "dynamic_const_123"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 4
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_2relu1_2"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_122:0"
    name: "dynamic_const_122"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 5
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_3relu1_3"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_121:0"
    name: "dynamic_const_121"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 6
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_4relu1_4"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_120:0"
    name: "dynamic_const_120"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 7
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_5relu1_5"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_119:0"
    name: "dynamic_const_119"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 8
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_6relu1_6"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_118:0"
    name: "dynamic_const_118"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 9
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_7relu1_7"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_117:0"
    name: "dynamic_const_117"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 10
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_8relu1_8"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_116:0"
    name: "dynamic_const_116"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 11
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_9relu1_9"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_115:0"
    name: "dynamic_const_115"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 12
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_10relu1_10"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_114:0"
    name: "dynamic_const_114"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 13
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_11relu1_11"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_113:0"
    name: "dynamic_const_113"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 14
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_12relu1_12"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_112:0"
    name: "dynamic_const_112"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 15
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_13relu1_13"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_111:0"
    name: "dynamic_const_111"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 16
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_14relu1_14"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_110:0"
    name: "dynamic_const_110"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 17
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_15relu1_15"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_109:0"
    name: "dynamic_const_109"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 18
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_16relu1_16"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_108:0"
    name: "dynamic_const_108"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 19
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_17relu1_17"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_107:0"
    name: "dynamic_const_107"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 20
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_18relu1_18"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_106:0"
    name: "dynamic_const_106"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT16"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 9
      ints: 1
      ints: 16
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "FRACTAL_Z"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 4640
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 21
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "dst_name"
      strings: "conv1_19relu1_19"
      type: STRINGS
    }
    attribute {
      name: "dst_index"
      ints: 1
      type: INTS
    }
    attribute {
