ir_version: 6
producer_name: "GE"
graph {
  node {
    input: ""
    output: "data:0"
    name: "data"
    op_type: "ge:Data"
    attribute {
      name: "input_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "input_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "input_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "input_desc_origin_shape:0"
      type: INTS
    }
    attribute {
      name: "input_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "input_desc_size:0"
      i: 3145728
      type: INT
    }
    attribute {
      name: "input_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_reuse_input:0"
      type: INT
    }
    attribute {
      name: "input_desc_output_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "input_desc_input_tensor:0"
      type: INT
    }
    attribute {
      name: "input_desc_real_dim_cnt:0"
      type: INT
    }
    attribute {
      name: "input_desc_data_offset:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_size:0"
      type: INT
    }
    attribute {
      name: "input_desc_cmps_tab:0"
      type: STRING
    }
    attribute {
      name: "input_desc_cmps_tab_offset:0"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      i: 3145760
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 3
      ints: 512
      ints: 512
      type: INTS
    }
    attribute {
      name: "id"
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "data_type"
      type: INT
    }
    attribute {
      name: "_input_name_idx_value"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "dynamic_const_49:0"
    name: "dynamic_const_49"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      type: INTS
    }
    attribute {
      name: "id"
      i: 1
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_48:0"
    name: "dynamic_const_48"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 2
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 1
      ints: 32
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_47:0"
    name: "dynamic_const_47"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 3
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_46:0"
    name: "dynamic_const_46"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 4
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_45:0"
    name: "dynamic_const_45"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 5
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_44:0"
    name: "dynamic_const_44"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 6
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_43:0"
    name: "dynamic_const_43"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 7
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_42:0"
    name: "dynamic_const_42"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 8
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_41:0"
    name: "dynamic_const_41"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 9
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_40:0"
    name: "dynamic_const_40"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 10
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_39:0"
    name: "dynamic_const_39"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 11
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_38:0"
    name: "dynamic_const_38"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 12
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_37:0"
    name: "dynamic_const_37"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 13
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_36:0"
    name: "dynamic_const_36"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 14
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_35:0"
    name: "dynamic_const_35"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 15
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_34:0"
    name: "dynamic_const_34"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 16
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_33:0"
    name: "dynamic_const_33"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 17
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_32:0"
    name: "dynamic_const_32"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 18
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_31:0"
    name: "dynamic_const_31"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 19
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_30:0"
    name: "dynamic_const_30"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 20
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_29:0"
    name: "dynamic_const_29"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 21
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_28:0"
    name: "dynamic_const_28"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 22
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_27:0"
    name: "dynamic_const_27"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 23
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_26:0"
    name: "dynamic_const_26"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 24
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 8
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_25:0"
    name: "dynamic_const_25"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      type: INTS
    }
    attribute {
      name: "id"
      i: 25
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_24:0"
    name: "dynamic_const_24"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 4
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "id"
      i: 26
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 8
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_23:0"
    name: "dynamic_const_23"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_origin_layout:0"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "output_desc_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_weight_size:0"
      type: INT
    }
    attribute {
      name: "output_desc_device_type:0"
      s: "NPU"
      type: STRING
    }
    attribute {
      name: "output_desc_real_dim_cnt:0"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_attr_origin_shape:0"
      ints: 16
      type: INTS
    }
    attribute {
      name: "id"
      i: 27
      type: INT
    }
    attribute {
      name: "stream_id"
      type: INT
    }
    attribute {
      name: "value_desc_dtype"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "value_desc_shape"
      ints: 16
      type: INTS
    }
    attribute {
      name: "value_desc_layout"
      s: "NCHW"
      type: STRING
    }
    attribute {
      name: "value_desc_device_type"
      s: "NPU"
      type: STRING
    }
  }
  node {
    output: "dynamic_const_22:0"
    name: "dynamic_const_22"
    op_type: "ge:Const"
    attribute {
      name: "input_desc_nums"
      type: INT
    }
    attribute {
      name: "output_desc_nums"
      i: 1
      type: INT
    }
    attribute {
      name: "output_desc_dtype:0"
      s: "DT_FLOAT"
      type: STRING
    }
    attribute {
      name: "output_desc_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_origin_shape:0"
      ints: 16
      ints: 16
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_desc_layout:0"
      s: "NCHW"
